app/Controllers/DashboardController.php

    public function index() {

        $totalConsultas = $this->consultas->select("*")->where("deleted_at", null)->countAllResults();
        $totalCitas = $this->citas->select("*")->where("deleted_at", null)->countAllResults();
        $totalPacientes = $this->pacientes->select("*")->where("deleted_at", null)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `consultas`
WHERE `deleted_at` IS NULL
AND `consultas`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `citas`
WHERE `deleted_at` IS NULL
AND `citas`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `pacientes`
WHERE `deleted_at` IS NULL
AND `pacientes`.`deleted_at` IS NULL