app/Controllers/HospitalController.php

    public function index() {




        $datos = $this->configuraciones->where("id", 1)->first();
---
SELECT *
FROM `configuraciones`
WHERE `id` = 1
AND `configuraciones`.`deleted_at` IS NULL
 LIMIT 1

    public function guardar() {


        helper('auth');
        $userName = user()->username;
        $idUser = user()->id;

        $bitacoraDatos["descripcion"] = "Se Modifico las configuracion con los siguientes datos:" . json_encode($_POST);
        $bitacoraDatos["usuario"] = $userName;

        //GUARDA CONFIGURACIONES
        $this->configuraciones->update(1, $_POST);
---
UPDATE `configuraciones` SET `nombreHospital` = 'Hospital Generalasdasd', `correoElectronico` = 'asdaaasdsd@asd.comas', `RFC` = 'XXXAasdasdasdasd', `telefono` = '5646546321asdasd', `languaje` = 'de'
WHERE `configuraciones`.`id` IN (1)

        }

        //GUARDAR EN BITACORA
        $this->bitacora->save($bitacoraDatos);
---
INSERT INTO `bitacora` (`descripcion`, `usuario`, `created_at`, `updated_at`) VALUES ('Se Modifico las configuracion con los siguientes datos:{\"csrf_test_name\":\"a10e2d589b26c42e1b483b33e33a215e\",\"nombreHospital\":\"Hospital Generalasdasd\",\"correoElectronico\":\"asdaaasdsd@asd.comas\",\"RFC\":\"XXXAasdasdasdasd\",\"telefono\":\"5646546321asdasd\",\"languaje\":\"de\"}', 'admin', '2024-11-11 18:56:29', '2024-11-11 18:56:29')