app/Controllers/PacientesController.php

    public function traerPacientesAjax()
    {

        $request = service('request');
        $postData = $request->getPost();

        $response = array();

        // Read new token and assign in $response['token']
        $response['token'] = csrf_hash();

        if (!isset($postData['searchTerm'])) {
            // Fetch record
            $pacientes = new PacientesModel();
            $listaPacientes = $pacientes->select('id,nombres,apellidos')
                ->orderBy('nombres')
                ->findAll(10);
---
SELECT `id`, `nombres`, `apellidos`
FROM `pacientes`
WHERE `pacientes`.`deleted_at` IS NULL
ORDER BY `nombres`
 LIMIT 10