app/Models/ConsultasModel.php

    public function mdlTenPatientMoreFrequent() {

        $result = $this->db->table('consultas a, pacientes c')
                        ->select('concat(c.nombres,\' \',apellidos) as nombre,count(*) as total')
                        ->where('a.paciente', 'c.id', FALSE)
                        ->groupBy(array('a.paciente', 'concat(c.nombres,\' \',apellidos)'))
                        ->get(10)->getResultArray();
---
SELECT concat(c.nombres, ' ', apellidos) as nombre, count(*) as total
FROM `consultas` `a`, `pacientes` `c`
WHERE a.paciente = c.id
GROUP BY `a`.`paciente`, concat(c.nombres,' ',apellidos)
 LIMIT 10

    public function mdlTenDiagnosesFrequent() {

        $result = $this->db->table('consulta_diagnosticos a')
                ->select('a.descripcion,count(*) as total')
                ->groupBy(array('a.idDiagnostico', 'a.descripcion'))
                ->get(10)->getResultArray();
---
SELECT `a`.`descripcion`, count(*) as total
FROM `consulta_diagnosticos` `a`
GROUP BY `a`.`idDiagnostico`, `a`.`descripcion`
 LIMIT 10